const log = (msg) => console.log(msg);
// あんま良くないかもしれぬが、console.log()長いので

//############################################
// slice method
//############################################
// 対象の文字列の中の指定した位置にある部分文字列を
// 新しい文字列で返す
//---------------------------------------------

log("sliceの使い方:");
log("I my Me MINE".slice(2, 7));

//############################################
// substring
//############################################
// 説明
//---------------------------------------------

log("東京都港区".substring(0, 3));

//############################################
// 各単語を処理する
//############################################
// 最初の文字列を大文字にして、
//---------------------------------------------

let modified = "I am learning WEB DEV".split(" ")
  .map((s) => s[0].toUpperCase() + s.slice(1).toLowerCase()) // 最初のCharを大文字 + 残りを小文字にして結合
  .join(" "); // 各単語の結合

log(modified);

//############################################
// 配列
//############################################
// 書くメソッドのテストをするために配列用意
//---------------------------------------------

const articleList = [
  {
    title: "Life",
    subtitle: "subtitile",
    date: "2023/07/23",
  },
  {
    title: "aritcle2",
    subtitle: "subtitile2",
    date: "2023/08/24",
  },
];

//############################################
// forEach
//############################################
// 便利なループ
//---------------------------------------------

"I am learning WEB DEV".split(" ").forEach((a) => console.log(a));

console.log(null || "hello world!");

//############################################

articleList.forEach((el) => {
  console.log(el.title);
  console.log(el);
});

articleList.map((el) => {
  console.log(el);
});

//############################################
// find
//############################################
// 要素がマッチした場合等
// の要素を週出する
//---------------------------------------------

const matched_array = articleList.find((el) => el.title != "article2");
console.log(".find method:", matched_array);

//
